<a href="https://colab.research.google.com/github/badalkchy/pandas/blob/main/1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Python code demonstrate creating 
# DataFrame from dict narray / lists 
# By default addresses.

import pandas as pd

# intialise data of lists.
data = {
    'Name':['Tom', 'nick', 'krish', 'jack'],
    'Age':[20, 21, 19, 18],
    'Subject':['English','Maths','Science','Hindi'],
    'Marks':['45/50','40/50','43/50','47/50']
}

# Create DataFrame
df = pd.DataFrame(data)

# Print the output.
# print(df)
df

    Name  Age  Subject  Marks
0    Tom   20  English  45/50
1   nick   21    Maths  40/50
2  krish   19  Science  43/50
3   jack   18    Hindi  47/50

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
dict(df)

{'Age': 0    20
 1    21
 2    19
 3    18
 Name: Age, dtype: int64, 'Marks': 0    45/50
 1    40/50
 2    43/50
 3    47/50
 Name: Marks, dtype: object, 'Name': 0      Tom
 1     nick
 2    krish
 3     jack
 Name: Name, dtype: object, 'Subject': 0    English
 1      Maths
 2    Science
 3      Hindi
 Name: Subject, dtype: object}

In [ ]:
a=['Name','badal','amit','vicky']
a

['Name', 'badal', 'amit', 'vicky']